---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductSizeDescription
source: html/fae15ff9-7b7d-5a50-f620-63d11399b78e.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductSizeDescription Property

The product size description of the fabrication part.

## Syntax (C#)
```csharp
public string ProductSizeDescription { get; }
```